package ge.tbc.testautomation.data.enums;

import java.util.List;

public enum OfferCategory {
    KAKHETI(List.of("სიღნაღში", "კახეთი", "თელავი", "ყვარელი", "ლაგოდეხი", "სიღნაღში", "კახეთში", "თელავში", "ყვარელში", "ლაგოდეხში")),
    GEOERGIA_TOURS(List.of("ძველი თბილისი", "რივერ თრიფ თბილისი")),
    HOTELS_WITH_SWIMMING_POOLS(List.of("აუზი", "აუზით")),
    MOUNTAIN_RESORTS(List.of("მთის", "ბაკურიანში", "გუდაურში", "სვანეთში", "ყაზბეგში", "სამთოში", "სტეფანწმინდაში", "წალკის", "ბორჯომი", "Kazbegi", "საბადურში", "დუშეთი", "დუშეთში", "მესტია", "მესტიაში", "კახეთში", "რაბათი", "haystack", "ნანოლენდი", "ბაკურიანი", "სიონი", "საირმე", "haystack-ში", "ორბი", "წყალტუბო", "Mountain House Kazbegi", "House")),
    TBILISI_AND_SURROUNDINGS(List.of("ვაშლიჯვარი", "ვაშლიჯვარში", "დიღომი", "დიღომში", "ავლაბარი", "ავლაბარში", "ნაძალადევი", "ნაძალადევში", "საბურთალო", "საბურთალოზე", "მცხეთა", "მცხეთაში", "დუშეთი", "დუშეთში", "დუშეთის", "სიონი", "სიონში", "წყნეთი", "წყნეთში", "მუხრანში", "თბილისის", "მთაწმინდა", "მთაწმინდაზე", "ბაზალეთში")),
    SEASIDE_HOTELS(List.of("ბათუმი", "ბათუმში", "ქობულეთი", "ქობულეთში", "შეკვეთილი", "შეკვეთილში", "ჩაქვში", "ჩაქვი", "ციხისძირი", "ციხისძირში", "ორბი", "სითი", "ოაზისი", "კაპროვანში")),
    NIGHTCLUB(List.of("ბარის", "ბარი", "Bar", "კლუბი")),
    BOWLING(List.of("ბოულინგი", "ბოულინგზე")),
    KARAOKE(List.of("ბარი", "კარაოკე", "Karaoke")),
    BILLIARDS(List.of("ბილიარდი", "ბილიარდზე")),
    MUSEUM(List.of("მუზეუმი", "ჰოლოზეუმი")),
    LOUNGE(List.of("ლაუნჯი", "Lounge", "პაბი", "ადამიანზე", "სტუმარზე")),TEENAGERS_ENTERTAINMENT(List.of("თინეიჯერული", "წვეულებისთვის", "თინეიჯერზე", "სათამაშო", "არასრულწლოვნებისთვის", "თამაში", "ბავშვზე", "დაბადების დღის", "გასართობი")),
    GAME_ZONE(List.of("გეიმ ზონა", "Game Zone", "გასართობი", "თამაში", "მაფიის ღამის", "Game", "გეიმ")),

    CAFE_BAR(List.of("ბარი", "კაფე-ბარი","სახლი", "პანორამა")),
    RESTAURANT(List.of("რესტორანი", "ადამიანი", "ადამიანზე", "სტუმარი", "სტუმარზე")),
    PUB(List.of("პაბი", "სახლი")),
    ASIAN_CUISINE(List.of("საკე", "სუშის", "ჯეკი ჩანი", "სუში", "სუშიკო")),
    BRASSERIE(List.of("ღვინო", "ღვინის")),

    CHILDREN_ENTERTAINMENT_CENTER(List.of("დაბადების დღე" ,"დაბადების დღის", "გასართობი", "ექსკურსია")),
    PHOTO_VIDEO_STUDIO(List.of("ფოტოსესია", "ფოტოგადაღება", "ფოტო-გადაღება", "გადაღება")),
    PHOTOSHOOT(List.of("ფოტოსესია")),
    CALLING_HEROES(List.of("გამოძახებით", "გმირის", "გმირი", "გასართობი", "დაბადების დღის", "პროგრამა", "ანიმატორთან", "გმირების","ბუშტები", "მსახიობები", "გმირები", "ბუშტის" )),
    MUSEUM_FOR_KIDS(List.of("მუზეუმი")),
    KARTING(List.of("კარტინგი")),


    YOGA_PILATES_AEROBICS(List.of("ვარჯიში", "ვარჯიშები", "სპა", "ერობიკა")),
    FITNESS(List.of("ფიტნესის", "ფიტნესი")),
    AEROBICS(List.of("აერობიკის")),
    SWIMMING_POOLS(List.of("ცურვის", "აუზის", "აუზი", "სპა", "აუზზე")),
    BASKETBALL_COURT(List.of("Shoot")),
    TENNIS(List.of("ჩოგბურთის")),
    TABLE_TENNIS(List.of("ტენისი", "ტენისის")),
    SPORTS_HALL_RENTAL(List.of("ჯიმ", "სპორტული", "ფიტნესის", "სატრენაჟორო")),
    PADEL(List.of("პადელის")),
    HORSE_RIDING(List.of("ცხენით", "საცხენოსნო", "ცხენებზე")),

    PLASTIC_SURGERY(List.of("იმპლანტებით", "ქირურგიული", "პროცედურა")),
    SAUNA_JACUZZI_SPA(List.of("საუნაში")),
    HAIR_REMOVAL(List.of("ეპილაცია", "ბიოეპილაცია")),
    MASSAGE(List.of("მასაჟი", "მასაჟის", "გამაჯანსაღებელი", "სამასაჟზე", "პაკეტი", "რელაქს-მასაჟი", "ესთეტიკის", "ლიმფოდრენაჟი")),
    SOLARIUM(List.of("სოლარიუმის", "სოლარიუმში")),
    AESTHETIC_DENTISTRY(List.of("კბილების", "ბრეკეტი", "ბრეკეტები", "ვინირები", "რესტრავრაცია", "ბრეკეტები", "ბრეკეტის", "კბილის", "გათეთრება", "კერამიკის")),
    INSTRUMENTAL_PROCEDURES(List.of("თერაპია", "პროცედურა", "კორექციის", "დეტოქს-პროგრამა", "წმენდა", "გასახდომი", "ეპილაცია", "პლაზმოლიფტინგი", "პროცედურები", "უოპერაციო", "მასაჟი", "კორექცია" )),
    NAILS(List.of("მანიკური", "მანიკურის", "ფრჩხილის", "ნუნების", "გელ-ლაქი", "მანიკურ-პედიკური", "მანიკურ-პედიკურის", "სალონური", "ფრჩხილების", "პედიკური", "შილაქი", "ხელის")),
    HAIR_BEARD(List.of("მეზოთერაპიის", "მეზოთერაპია", "მასაჟის", "თმის", "სკალპის", "სილამაზის", "ვარცხნილობა", "სალონური", "Beauty")),
    MAKEUP(List.of("მაკიაჟი", "სილამაზის", "studio", "კორექცია", "მაკიაჟის", "სალონური")),
    FACIAL_CARE(List.of("ბიორევიტალიზაციის", "პროცედურა","სახის", "პროცედურები", "ბუსტერი", "წმენდა", "სილამაზის")),
    EYEBROW_EYELASHES(List.of("წამწამების", "წამწამის", "წარბის", "სალონური", "პერმანენტული", "ესთეტიკის")),
    TATTOO(List.of("ტატუს")),


    DENTIST(List.of("კბილების", "კბილის", "პროტეზი", "კაპა", "კაპები", "წმენდა", "დაბჟენა", "კბილების", "გათეთრება", "კბილის", "ორთოპედიული", "პროცედურა", "ბრეკეტები", "კერამიკის", "იმპლანტი", "ვინირება")),
    LABORATORY_DIAGNOSTIC_CENTER(List.of("კვლევა", "კლინიკა")),
    CLININC(List.of("კვლევა", "ქირურგიული", "მოშორება", "კლინიკა", "სამედიცინო")),
    CONSULTATION(List.of("მომსახურება", "კლინიკა")),
    THERAPY(List.of("თერაპიის")),


    DRIVING_SCHOOL(List.of("ავტოსკოლა", "ავტო", "დრაივერი", "პრაქტიკული", "პრაქტიკის", "მართვის")),

    PET_CARE(List.of("კატების", "ძაღლების", "გრუმინგი", "თერაპიული"));


    private final List<String> keywords;

    OfferCategory(List<String> keywords) {
        this.keywords = keywords;
    }

    public List<String> getKeywords() {
        return keywords;
    }
}
